
&НаКлиенте
Процедура ТоварыКоличествоПриИзменении(Элемент)
	РаботаСЭлементамиФормКлиент.ПосчитатьСуммуВТабличнойЧасти(Элементы.Товары.ТекущиеДанные);
КонецПроцедуры

&НаКлиенте
Процедура ТоварыЦенаПриИзменении(Элемент)
	РаботаСЭлементамиФормКлиент.ПосчитатьСуммуВТабличнойЧасти(Элементы.Товары.ТекущиеДанные);
КонецПроцедуры

&НаКлиенте
Процедура ПриОткрытии(Отказ)
	УстановитьТекущуюАкцию(Истина);
КонецПроцедуры

&НаКлиенте
Процедура ДатаПриИзменении(Элемент)
	УстановитьТекущуюАкцию(Истина);
КонецПроцедуры

//////////////////////////////////////////

Процедура УстановитьТекущуюАкцию(Знач НеПроверятьНаличие = Ложь) Экспорт
	Если НеПроверятьНаличие Тогда
		Объект.Акция = ПолучитьТекущуюАкцию(НачалоДня(?(ЗначениеЗаполнено(Объект.Дата), Объект.Дата, ТекущаяДата())));
	Иначе
		Если НЕ ЗначениеЗаполнено(Объект.Акция) Тогда
			Объект.Акция = ПолучитьТекущуюАкцию(НачалоДня(?(ЗначениеЗаполнено(Объект.Дата), Объект.Дата, ТекущаяДата())));
		КонецЕсли;
	КонецЕсли;
КонецПроцедуры

Функция ПолучитьТекущуюАкцию(Период)
	_Запрос = Новый Запрос;
	_Запрос.Текст =
		"ВЫБРАТЬ
		|	МАКСИМУМ(Акции.ДатаНачалаДействия) КАК ДатаНачалаДействия
		|ПОМЕСТИТЬ втМаксимальнаяДатаАкцийНаПериод
		|ИЗ
		|	Справочник.Акции КАК Акции
		|ГДЕ
		|	Акции.ДатаНачалаДействия <= &Период
		|	И НЕ Акции.ПометкаУдаления
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	Акции.Ссылка
		|ИЗ
		|	Справочник.Акции КАК Акции
		|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ втМаксимальнаяДатаАкцийНаПериод КАК втМаксимальнаяДатаАкцийНаПериод
		|		ПО Акции.ДатаНачалаДействия = втМаксимальнаяДатаАкцийНаПериод.ДатаНачалаДействия
		|ГДЕ
		|	НЕ Акции.ПометкаУдаления";

	_Запрос.УстановитьПараметр("Период", Период);

	Выборка = _Запрос.Выполнить().Выбрать();

	Если Выборка.Следующий() Тогда
		Результат = Выборка.Ссылка;
	Иначе
		Результат = Справочники.Акции.ПустаяСсылка();
	КонецЕсли;

	Возврат Результат;
КонецФункции

