
&НаСервере
Функция ПолучитьСтатусЗакрытияМесяцаНаСервере(НоваяДата)
	Возврат МодульЗакрытиеМесяца.ПолучитьСтатусЗакрытияМесяца(НоваяДата);
КонецФункции

&НаКлиенте
Процедура ОтобразитьСтатусЗакрытияМесяца(МесяцЗакрыт)
	ДатаЗакрытияСтрока = Формат(ДатаЗакрытия, "ДФ='ММММ гггг'");

	Элементы.ГруппаСтатусМесяцаНеЗакрыт.Видимость = НЕ МесяцЗакрыт;
	Элементы.ГруппаСтатусМесяцаЗакрыт.Видимость = МесяцЗакрыт;
КонецПроцедуры

&НаКлиенте
Процедура ИзменитьДатуЗакрытия(НоваяДата)
	МесяцЗакрыт = ПолучитьСтатусЗакрытияМесяцаНаСервере(НоваяДата);

	ОтобразитьСтатусЗакрытияМесяца(МесяцЗакрыт);
КонецПроцедуры

//////////////////////////////////////////

&НаКлиенте
Процедура ПриОткрытии(Отказ)
	ДатаЗакрытия = НачалоМесяца(ТекущаяДата());

	ИзменитьДатуЗакрытия(ДатаЗакрытия);
КонецПроцедуры

&НаКлиенте
Процедура КомандаМесяцНазад(Команда)
	ДатаЗакрытия = ДобавитьМесяц(ДатаЗакрытия, -1);

	ИзменитьДатуЗакрытия(ДатаЗакрытия);
КонецПроцедуры

&НаКлиенте
Процедура КомандаМесяцВперед(Команда)
	ДатаЗакрытия = ДобавитьМесяц(ДатаЗакрытия, 1);

	ИзменитьДатуЗакрытия(ДатаЗакрытия);
КонецПроцедуры

&НаСервере
Процедура ЗакрытьМесяцНаСервере()
	
КонецПроцедуры

&НаКлиенте
Процедура ЗакрытьМесяц(Команда)
	ЗакрытьМесяцНаСервере();

	ИзменитьДатуЗакрытия(ДатаЗакрытия);
КонецПроцедуры
