# encoding: utf-8
# language: ru

@tree

Функционал: Учет расходов по привлечению клиентов
	Как Маркетолог
	Хочу в документе "Покупка" фиксировать сумму затрат на привлечение клиентов
	Чтобы анализировать эффективность маркетинговых акций

Контекст: 
	Допустим я подготавливаю документ с номером "000000000" документов "Покупка"
	И Я запускаю сценарий открытия TestClient или подключаю уже существующий

Сценарий: Фиксирование затрат в новом документе
	#Допустим я подготавливаю вспомогательные данные
	Когда я создаю покупку
		Когда В панели разделов я выбираю "Покупки"
		И     В панели функций я выбираю "Покупки"
		Тогда открылось окно "Покупки"
		И     я нажимаю на кнопку "Создать"
		Тогда открылось окно "Покупка (создание)"
	И Я заполняю шапку документа
		Когда в поле "Номер" я ввожу текст ""
		Тогда открылось окно "1С:Предприятие"
		И     я нажимаю на кнопку "Да"
		Тогда открылось окно "Покупка (создание)"
		И     в поле "Номер" я ввожу текст "TEST00000"
		Когда я открываю выпадающий список "Поставщик"
		И     я выбираю значение реквизита "Поставщик" из формы списка
		Тогда открылось окно "Клиенты"
		И     я нажимаю на кнопку "Список"
		И     В форме "Клиенты" в таблице "Список" я перехожу к строке:
		| 'Код'       | 'Наименование'       |
		| '000000005' | 'ИП Самохвалов А.А.' |
		И     я нажимаю на кнопку "Выбрать"
	И Я выбираю акции
		Когда открылось окно "Покупка (создание) *"
		И     я перехожу к закладке "Затраты на акции"
		#И     я перехожу к закладке "Страницы"
		И     в ТЧ "ЗатратыНаАкции" я нажимаю на кнопку "Добавить"
		И     в ТЧ "ЗатратыНаАкции" я выбираю значение реквизита "Акция" из формы списка
		Тогда открылось окно "Акции"
		#И     я нажимаю на кнопку "Список"
		И     В форме "Акции" в таблице "Список" я перехожу к строке:
		| 'Код'       | 'Наименование'      |
		| '000000003' | '3 товар в подарок' |
		И     я нажимаю на кнопку "Выбрать"
		Тогда открылось окно "Покупка (создание) *"
		И     в ТЧ "ЗатратыНаАкции" я активизирую поле "Сумма"
		И     в ТЧ "ЗатратыНаАкции" в поле "Сумма" я ввожу текст "15 000,00"
		И     В форме "Покупка (создание) *" в ТЧ "ЗатратыНаАкции" я завершаю редактирование строки
	И Я провожу документ
		Когда открылось окно "Покупка (создание) *"
		И     я нажимаю на кнопку "Провести"
		#И     Пауза 2
	Тогда результат проведения корректен
		Когда открылось окно "Покупка TEST00000 от *"
		И     таблица формы с именем "ЗатратыНаАкции" стала равной:
			| 'Акция'             | 'N' | 'Сумма'     |
			| '3 товар в подарок' | '1' | '15 000,00' |
		#И     В текущем окне я нажимаю кнопку командного интерфейса "Партии товаров"
		#Тогда таблица формы с именем "Список" стала равной:
		#	| 'Период' | 'Номенклатура'      | 'Количество' | 'Регистратор' | 'Номер строки' | 'Партия' |
		И     Пауза 2
		Тогда Я закрыл все окна клиентского приложения
		И     Удалить документ типа "Покупка" с номером "TEST00000"

Сценарий: Фиксирование затрат в существующем непроведенном документе
	#Допустим я подготавливаю вспомогательные данные
	Когда когда я открываю покупку
		Когда В панели разделов я выбираю "Главное"
		И     В панели разделов я выбираю "Покупки"
		И     В панели функций я выбираю "Покупки"
		Тогда открылось окно "Покупки"
		И     В форме "Покупки" в таблице "Список" я перехожу к строке:
		| 'Номер'     |
		| '000000000' |
		И     я нажимаю на кнопку "Изменить"
		Тогда открылось окно "Покупка 000000000 от *"
	И Я выбираю акции
		Когда я перехожу к закладке "Затраты на акции"
		#И     я перехожу к закладке "Страницы"
		И     в ТЧ "ЗатратыНаАкции" я нажимаю на кнопку "Добавить"
		И     в ТЧ "ЗатратыНаАкции" я выбираю значение реквизита "Акция" из формы списка
		Тогда открылось окно "Акции"
		#И     я нажимаю на кнопку "Список"
		И     В форме "Акции" в таблице "Список" я перехожу к строке:
		| 'Код'       | 'Наименование'      |
		| '000000003' | '3 товар в подарок' |
		И     я нажимаю на кнопку "Выбрать"
		Тогда открылось окно "Покупка 000000000 от *"
		И     в ТЧ "ЗатратыНаАкции" я активизирую поле "Сумма"
		И     в ТЧ "ЗатратыНаАкции" в поле "Сумма" я ввожу текст "7 000,00"
		И     В форме "Покупка 000000000 от *" в ТЧ "ЗатратыНаАкции" я завершаю редактирование строки
	И Я провожу документ
		Когда открылось окно "Покупка 000000000 от *"
		И     я нажимаю на кнопку "Провести"
	Тогда результат проведения корректен
		Когда таблица формы с именем "ЗатратыНаАкции" стала равной:
			| 'Акция'             | 'N' | 'Сумма'    |
			| '3 товар в подарок' | '1' | '7 000,00' |
		#И     В текущем окне я нажимаю кнопку командного интерфейса "Партии товаров"
		#Тогда таблица формы с именем "Список" стала равной:
		#	| 'Период' | 'Номенклатура'     | 'Количество' | 'Регистратор' | 'Номер строки' | 'Партия' |
		#	| *        | 'Фирменный брелок' | '5,00'       | *             | '1'            | *        |
		И     Удалить документ типа "Покупка" с номером "000000000"
		